통계적으로 '유의한 차이'는 
통계 분석에서 두 개 이상의 그룹 또는 조건 간의 차이가 
우연에 의한 것이 아니라 실제로 존재하는 것으로 여겨지는 경우를 말함

1.가설 설정: 연구자는 연구의 목적과 질문에 따라 귀무 가설(H0)과 대립 가설(H1)을 설정합니다. 
귀무 가설은 "그룹 간에 차이가 없다"라는 가정을 나타내고, 
대립 가설은 "그룹 간에 차이가 있다"라는 가정을 나타냅니다.

2.표본 수집: 연구에서 필요한 데이터를 수집하고, 각 그룹 또는 조건에서 관측값을 얻습니다. 
이때 표본 크기는 충분히 커야 신뢰할 수 있는 결과를 얻을 수 있습니다.

3.통계적 분석: 수집한 데이터를 바탕으로 적절한 통계적 분석 방법을 선택하고 수행합니다. 
일반적으로 t-검정, 분산 분석(ANOVA), 카이제곱 검정 등이 사용됩니다. 
분석을 통해 계산된 통계량과 p-값을 얻을 수 있습니다.

4.유의 수준 설정: 연구자는 유의 수준을 미리 설정합니다. 
일반적으로 0.05(또는 5%)가 사용되며, 이는 100번 중 5번의 오류를 허용하는 것을 의미합니다.

5.결과 해석: 통계 분석 결과로 얻은 p-값을 유의 수준과 비교하여 해석합니다. 
p-값이 유의 수준보다 작으면 귀무 가설을 기각하고 대립 가설을 채택합니다. 
이는 "통계적으로 유의한 차이가 있다"는 결론을 내릴 수 있습니다. 
반대로, p-값이 유의 수준보다 크다면 귀무 가설을 기각할 수 없으며, 
"통계적으로 유의한 차이가 없다"는 결론을 내릴 수 있습니다.

0.05보다 작으면 귀무가설 기각
0.05보다 크면 귀무가설 채택

P값이 0.05 미만인 경우 
평균 간에 차이가 없다는 귀무 가설을 기각하고 유의한 차이가 있다. 
P값이 0.05보다 크면 
0.05를 초과하면 유의하지 않습니다