# 데이터 - 평균 = 편차
# 분산 : 편차 제곱의 평균
# 표준편차 = 루트분산 
모분산 : 모집단의 분산 
표본분산: 표본의 분산 (n-1로 나눈다.)
n-1로 나누는 이유는 값의 정확도가 더 높기 때문
표본분산의 n-1을 보통 '자유도'라 부른다

확률본포는 데이터의 특성에 따라 이산확률분포 와 연속확률 분포로 나뉨
데이터가 정수로 딱 떨어져서 셀수 있는 경우 : 이산형 (이산확률분포 사용)
소수점 같은 이유로 데이터가 정수로 딱 떨어지지 않아서 셀 수 없는 경우 : 연속형 
(연속확률분포)는 일정한 구간을 설정한 후 해당 구간 안에 몇 이 있는지 파악해서 확률을 구함

<이산확률분포>
베르누이 분포 
이항분포
다항분포

<연속확률분포>
균등분포
지수분포
정규분포
t분포
카이제곱분포
F분포

베르누이 분포: 어떠한 실험을 했을 때 2가지의 상황만 나오는 경우
ex)양품or불량, 동전앞or뒤, 시험합겹or불합격
2가지의 상황만 나오는 실험을 '베르누이 시행'
p(x) = p^x(1-p)^(1-x) 
x = 0,1
성공확률+실패확률=100%
실패확률=100%-성공확률
100% = 1
성공확률 = p
실패확률 = 1 - p



